package sergeev.alexander;

public enum CurrencyCode {

    AED("AED", 3.67), // ОАЭ
    AFN("AFN", 83.5), // Афганистан
    ALL("ALL", 112.0), // Албания
    AMD("AMD", 400.0), // Армения
    ANG("ANG", 1.79), // Нидерландские Антильские острова
    AOA("AOA", 830.0), // Ангола
    ARS("ARS", 349.0), // Аргентина
    AUD("AUD", 1.5), // Австралия
    AWG("AWG", 1.79), // Аруба
    AZN("AZN", 1.7), // Азербайджан
    BAM("BAM", 1.85), // Босния и Герцеговина
    BBD("BBD", 2.0), // Барбадос
    BDT("BDT", 110.0), // Бангладеш
    BGN("BGN", 1.8), // Болгария
    BHD("BHD", 0.38), // Бахрейн
    BIF("BIF", 2800.0), // Бурунди
    BMD("BMD", 1.0), // Бермудские острова
    BND("BND", 1.35), // Бруней
    BOB("BOB", 6.91), // Боливия
    BRL("BRL", 5.22), // Бразилия
    BSD("BSD", 1.0), // Багамские острова
    BTN("BTN", 83.0), // Бутан
    BWP("BWP", 14.05), // Ботсвана
    BYN("BYN", 3.06), // Беларусь
    BZD("BZD", 2.0), // Белиз
    CAD("CAD", 1.34), // Канада
    CDF("CDF", 2500.0), // Демократическая Республика Конго
    CHF("CHF", 0.91), // Швейцария
    CLP("CLP", 910.0), // Чили
    CNY("CNY", 7.3), // Китай
    COP("COP", 4000.0), // Колумбия
    CRC("CRC", 540.0), // Коста-Рика
    CUP("CUP", 24.0), // Куба
    CVE("CVE", 102.0), // Кабо-Верде
    CZK("CZK", 23.0), // Чехия
    DJF("DJF", 177.0), // Джибути
    DKK("DKK", 7.1), // Дания
    DOP("DOP", 56.0), // Доминиканская Республика
    DZD("DZD", 138.0), // Алжир
    GBP("GBP", 1.27), // Британия
    EGP("EGP", 30.9), // Египет
    ERN("ERN", 15.0), // Эритрея
    ETB("ETB", 54.0), // Эфиопия
    EUR("EUR", 1.1), // Еврозона
    FJD("FJD", 2.27), // Фиджи
    FKP("FKP", 1.3), // Фолклендские острова
    GEL("GEL", 2.9), // Грузия
    GHS("GHS", 11.0), // Гана
    GIP("GIP", 1.3), // Гибралтар
    GMD("GMD", 63.0), // Гамбия
    GNF("GNF", 8600.0), // Гвинея
    GTQ("GTQ", 7.8), // Гватемала
    GYD("GYD", 208.0), // Гайана
    HKD("HKD", 7.83), // Гонконг
    HNL("HNL", 24.5), // Гондурас
    HRK("HRK", 7.53), // Хорватия
    HTG("HTG", 136.0), // Гаити
    HUF("HUF", 367.0), // Венгрия
    IDR("IDR", 15400.0), // Индонезия
    ILS("ILS", 3.7), // Израиль
    INR("INR", 83.0), // Индия
    IQD("IQD", 1310.0), // Ирак
    IRR("IRR", 42000.0), // Иран
    ISK("ISK", 140.0), // Исландия
    JMD("JMD", 155.0), // Ямайка
    JOD("JOD", 0.71), // Иордания
    JPY("JPY", 148.0), // Япония
    KES("KES", 147.0), // Кения
    KGS("KGS", 87.0), // Кыргызстан
    KHR("KHR", 4100.0), // Камбоджа
    KMF("KMF", 454.0), // Коморские острова
    KPW("KPW", 900.0), // КНДР
    KRW("KRW", 1320.0), // Южная Корея
    KWD("KWD", 0.31), // Кувейт
    KYD("KYD", 0.83), // Каймановы острова
    KZT("KZT", 476.0), // Казахстан
    LAK("LAK", 20000.0), // Лаос
    LBP("LBP", 15000.0), // Ливан
    LKR("LKR", 365.0), // Шри-Ланка
    LRD("LRD", 185.0), // Либерия
    LSL("LSL", 19.0), // Лесото
    LYD("LYD", 4.85), // Ливия
    MAD("MAD", 10.25), // Марокко
    MDL("MDL", 18.0), // Молдова
    MGA("MGA", 4500.0), // Мадагаскар
    MKD("MKD", 57.0), // Северная Македония
    MMK("MMK", 2100.0), // Мьянма
    MNT("MNT", 3550.0), // Монголия
    MOP("MOP", 8.06), // Макао
    MRU("MRU", 38.0), // Мавритания
    MUR("MUR", 44.0), // Маврикий
    MVR("MVR", 15.0), // Мальдивы
    MWK("MWK", 1130.0), // Малави
    MXN("MXN", 18.0), // Мексика
    MYR("MYR", 4.77), // Малайзия
    MZN("MZN", 64.0), // Мозамбик
    NAD("NAD", 19.0), // Намибия
    NGN("NGN", 790.0), // Нигерия
    NIO("NIO", 36.3), // Никарагуа
    NOK("NOK", 10.7), // Норвегия
    NPR("NPR", 132.0), // Непал
    NZD("NZD", 1.6), // Новая Зеландия
    OMR("OMR", 0.38), // Оман
    PAB("PAB", 1.0), // Панама
    PEN("PEN", 3.7), // Перу
    PGK("PGK", 3.52), // Папуа-Новая Гвинея
    PHP("PHP", 56.0), // Филиппины
    PKR("PKR", 280.0), // Пакистан
    PLN("PLN", 4.3), // Польша
    PYG("PYG", 7250.0), // Парагвай
    QAR("QAR", 3.64), // Катар
    RON("RON", 4.6), // Румыния
    RSD("RSD", 111.0), // Сербия
    RUB("RUB", 93.0), // Россия
    RWF("RWF", 1200.0), // Руанда
    SAR("SAR", 3.75), // Саудовская Аравия
    SBD("SBD", 8.29), // Соломоновы острова
    SCR("SCR", 14.1), // Сейшельские острова
    SDG("SDG", 580.0), // Судан
    SEK("SEK", 10.9), // Швеция
    SGD("SGD", 1.35), // Сингапур
    SHP("SHP", 1.3), // Остров Святой Елены
    SLL("SLL", 18300.0), // Сьерра-Леоне
    SOS("SOS", 570.0), // Сомали
    SRD("SRD", 37.0), // Суринам
    SSP("SSP", 650.0), // Южный Судан
    STD("STD", 22750.0), // Сан-Томе и Принсипи
    SVC("SVC", 8.75), // Сальвадор
    SYP("SYP", 2500.0), // Сирия
    SZL("SZL", 19.0), // Эсватини
    THB("THB", 35.0), // Таиланд
    TJS("TJS", 11.4), // Таджикистан
    TMT("TMT", 3.5), // Туркменистан
    TND("TND", 3.1), // Тунис
    TOP("TOP", 2.3), // Тонга
    TRY("TRY", 27.4), // Турция
    TTD("TTD", 6.8), // Тринидад и Тобаго
    TWD("TWD", 32.0), // Тайвань
    TZS("TZS", 2500.0), // Танзания
    UAH("UAH", 37.0), // Украина
    UGX("UGX", 3750.0), // Уганда
    USD("USD", 1.0), // США
    UYU("UYU", 39.0), // Уругвай
    UZS("UZS", 12300.0), // Узбекистан
    VES("VES", 33.0), // Венесуэла
    VND("VND", 24400.0), // Вьетнам
    VUV("VUV", 119.0), // Вануату
    WST("WST", 2.7), // Самоа
    XAF("XAF", 620.0), // Центральноафриканский франк
    XCD("XCD", 2.7), // Восточно-карибский доллар
    XOF("XOF", 620.0), // Западноафриканский франк
    XPF("XPF", 108.0), // Французский тихоокеанский франк
    YER("YER", 250.0), // Йемен
    ZAR("ZAR", 19.0), // Южная Африка
    ZMW("ZMW", 22.0), // Замбия
    ZWL("ZWL", 930.0); // Зимбабве

    private final String code;
    private final double exchangeRate;

    CurrencyCode(String code, double exchangeRate) {
        this.code = code;
        this.exchangeRate = exchangeRate;
    }

    public String getCode() {
        return code;
    }

    public double getExchangeRate() {
        return exchangeRate;
    }
}